
           01 B-COORDINATES.
               05 BLACK-PIECES OCCURS 16 TIMES.
                  10 B-X-VAR         PIC S9(2).
                  10 B-X-POS         PIC S9(2).
                  10 B-Y-POS         PIC S9(2).
                  10 B-NEW-X         PIC S9(2).
                  10 B-NEW-Y         PIC S9(2).
                  10 B-PIECE         PIC X(2).
                  10 B-FIRST         PIC X(1).
